# RebarSpliceGeometry Properties

---
The RebarSpliceGeometry type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| SpliceNormal|  Identifies the splice face normal.
| SpliceOrigin|  Identifies the splice face origin.
Top
#### Reference
RebarSpliceGeometry Class
Autodesk.Revit.DB.Structure Namespace